import math
from random import random


def foo(n):
    counter = 0
    for i in range(n):
        a, b = random(), random()
        if math.sqrt(a ** 2 + b ** 2) <= 1:
            counter += 1

    print(4 * counter / n)

foo(10)
foo(1000)
foo(100000)
foo(10000000)


"""
პროგრამის გაშვების შემდეგ მიღებული შედეგის მიხედვით, ჩვენ შეგვიძლია ვთქვათ, რომ შემავალი რიცხვის ზრდასთან ერთად
ფუნქციოდან დაბრუნებული რიხცვი სულ უფრო და უფრო უახლოვდება π-ის მნიშვნელობას.
ჩვენი ფუნქცია π-ის მნიშვნელობასთან მიახლოებას ახდენს მონტე კარლოს მეთოდის გამოყენებით.
ჩვენ ვაგენერირებთ ერთეულოვან კვადრატში შემავალ წერტილებს.
წერტილების წილი, რომელიც აკმაყოფილებს math.sqrt(a² + b²) ≤ 1 პირობას უდრის 1 რადიუსიანი წრის მეთხედის ფართობს შეფარდებული
კვადრატის ფართობს ანუ π/4-ს. შედეგად, ფორმულით 4 × (counter / n), შემავალი რიცხვის ზრდასთან ერთად,  შეგვიძლია 
სულ უფრო და უფრო მივუახლოვდეთ π-ს მნიშვნელობას.
"""