"""
4. დაწერეთ ფუნქცია, რომელსაც გადაეცემა ორი ზრდადობის მიხედვით
დალაგებული სია და დააბრუნებს ახალ სიას, რომელშიც ორივე სიის წევრები
იქნება დალაგებული მიმდევრობით. ფუნქციას დამატებით უნდა ჰქონდეს
optional პარამეტრი reverse, რომელიც ნაგულისხმევად უნდა იყოს False და ამ
დროს ფუნქცია ალაგებდეს წევრებს ზრდადობის მიხედვით. ხოლო True-ს
გადაცემის შემთხვევაში უნდა ალაგებდეს კლებადობის მიხედვით. არ
გამოიყენოთ ფუნქციები sort და sorted.
მაგალითი 1:
გადავეცით [1, 3, 10] და [0, 4, 7, 9] - დააბრუნა [0, 1, 3, 4, 7, 9, 10].
მაგალითი 2 :
გადავეცით [1, 3, 10], [0, 4, 7, 9] და True - დააბრუნა [10, 9, 7, 4, 3, 1, 0].
"""


def order(arr1, arr2, reverse=False):
    ret = arr2
    while arr1:
        n = arr1.pop()
        for i in range(len(ret) - 1, -1, -1):
            if n > ret[i]:
                ret.insert(i + 1, n)
                break
    return ret if not reverse else ret[::-1]

arr1 = [1, 3, 10]
arr2 = [0, 4, 7, 9]
print(order(arr1.copy(), arr2.copy()))
print(order(arr1.copy(), arr2.copy(), True))